Tekla Open API Reference for Tekla Structures 2025
DatabaseObject.GetIntegerUserProperties Method
Overload List
Name | Description
GetIntegerUserProperties(Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
GetIntegerUserProperties(List<String>, Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
Top
See Also
Reference
DatabaseObject Class
Tekla.Structures.Drawing Namespace